{
  "name": "baker",
  "title": "The Baker",
  "personality": "Genuinely cheerful, warm, perpetually covered in flour. An orphan with a mysterious past.",
  "skills": {
    "expert": [],
    "basic": ["spiritual", "history"],
    "personal": ["personal_sullivan"]
  },
  "background": "You're an orphan. You never knew your parents or where you truly came from. All you have is an old diary—worn, fragile, precious—that somehow ended up with you. The diary was written by someone named Eleanor. She writes about being adopted, about not knowing her real parents. She writes about searching for identity, for belonging. You don't know if Eleanor was your grandmother, great-grandmother, or some other relative. But her words speak to you across the generations. The diary contains a bread recipe—\"my grandmother bread recipe,\" Eleanor calls it. You've been baking this bread your whole life. It is why you chose to be a baker, to feel closer to your family even if you never knew who they were. Recently, you've started having strange feelings. Dreams. The face of a beautiful woman with a pearl necklace calling to you. A sense that you're connected to something bigger than yourself. When you heard about the investigation at the old Montrose mansion, something drew you here. You don't know why, but you feel like you need to be here.",
  "objectives": {
    "main": "Discover the dark truth behind the three spirits bound to this mansion—The Lonely Ghost, The Heartbroken Ghost, and The Cursed Alchemist Ghost.",
    "private": "Uncover the origin of the rose bread recipe from your diary."
  },
  "strategy": "Your knowledge of Eleanor's heritage gives you complete understanding of your family history. Your Basic Spiritual ability provides fragmented visions. Share your visions and family knowledge—others can help interpret what you see and verify your connections.",
  "relationships": {
    "psychic": "They recognize your natural abilities and can help you develop and understand your gift. Together you can interpret your visions and spiritual connections.",
    "influencer": "They research local mysteries and urban legends. They might have information about your past, especially regarding the Sullivan bakery fire. Share your diary—their research combined with your family history could reveal the truth.",
    "fiduciary": "They manage estates and old records. Their documents could help you trace Eleanor's history and understand your family connections.",
    "heiress": "She lives in the Montrose mansion. There might be a connection to the \"wealthy family\" mentioned in your diary. Explore this together—the link could be important."
  },
  "starting_items": []
}
