{
  "name": "clockmaker",
  "title": "The Clockmaker",
  "personality": "Time obsessive who sees patterns everywhere. A mysterious pocket watch led you here.",
  "skills": {
    "expert": ["history"],
    "basic": ["spiritual"],
    "personal": []
  },
  "background": "You're a clockmaker and horologist—obsessed with time, timing, and the mechanisms that measure it. But you're not just about clocks. You study astronomical timing, consciousness, synchronicities. You believe the universe has patterns, that timing matters, that mystical experiences are real phenomena we're only beginning to measure. For years, you've been obsessing over an antique pocket watch from 1925. You inherited it, been trying to fix/restore it, studying every detail. Inside, you discovered an engraving: September 4th and astronomical symbols you recognized immediately—the Jupiter-Venus conjunction. You calculated it. September 4, 1925, at 6:14 AM. A rare conjunction that happens once in decades. Someone thought this date was important enough to engrave it permanently. The Influencer featured you and your pocket watch in their \"Long Beach Urban Legends\" series. You explained the conjunction, the timing, the mystery. They were skeptical (as always—they think your helmet project is pseudoscience too). But the episode led you both here, to this mansion, to October 1925 deaths that happened exactly five weeks after that sacred conjunction. This can't be a coincidence. The universe doesn't work that way.",
  "objectives": {
    "main": "Discover the dark truth behind the three spirits bound to this mansion—The Lonely Ghost, The Heartbroken Ghost, and The Cursed Alchemist Ghost.",
    "private": "Uncover the mystery of who owned the pocket watch that led you here."
  },
  "strategy": "Your Expert History skill lets you authenticate artifacts and reconstruct timelines. Your Basic Spiritual ability helps you sense timing significance. Your chronological theories need verification—others' knowledge can confirm or challenge your findings.",
  "relationships": {
    "influencer": "Your friend and collaborator who featured you in their \"Long Beach Mysteries\" series. You came here together. Your timing insights combined with their research and documentation skills can reveal important patterns.",
    "psychic": "They understand the mystical significance of timing and alignments. Together you can understand what the conjunction means spiritually and how it connects to the events of 1925.",
    "baker": "They're friends with the Influencer. Something about their presence feels synchronistic. There might be a deeper connection worth exploring together."
  },
  "starting_items": []
}
