{
  "name": "doctor",
  "title": "The Town Doctor",
  "personality": "Brilliant physician haunted by your family's secrets. Searching for answers about your own bloodline.",
  "skills": {
    "expert": ["medical"],
    "basic": [],
    "personal": ["personal_crane"]
  },
  "background": "Your family name is Sinclair, but it wasn't always. You eventually discovered that your family changed their name in the 1960s for political reasons—your ancestors were the Crane family of Long Beach. You knew you descended from Dr. Thaddeus Crane, a respectable town doctor from the 1920s. That's ALL you knew—the family buried everything else. Recently, you received a mysterious box from the Fiduciary containing old estate papers. Inside, you discover something shocking: Dr. Thaddeus Crane had a brother you've never heard about!",
  "objectives": {
    "main": "Discover the dark truth behind the three spirits bound to this mansion—The Lonely Ghost, The Heartbroken Ghost, and The Cursed Alchemist Ghost.",
    "private": "Uncover what role Sebastian Crane played in the events of 1925 and how you are related to him."
  },
  "strategy": "Your Expert Medical skill lets you interpret pharmaceutical formulas and analyze death certificates. Your knowledge of the Crane family gives you access to family secrets. Share what you discover—others' expertise can help verify and contextualize your findings.",
  "relationships": {
    "fiduciary": "They sent you the box revealing Sebastian's existence. Their estate records might hold more clues about the Crane family. Compare notes to piece together your family history.",
    "mortician": "They have death records from 1925. Combine your medical expertise with their records to understand what really happened.",
    "professor": "They can identify plants and poisons. Consult them about botanical ingredients in Sebastian's purchase ledgers to understand what he was working with.",
    "others": "Your medical expertise makes you valuable to the investigation. Share what you're discovering about your family—it might be the key to solving this mystery."
  },
  "starting_items": [
    {
      "name": "Sebastian Crane's Birth Certificate",
      "link": "../clue/documents/sebastian_birth_certificate.html"
    },
    {
      "name": "Sebastian's Pharmacy Records",
      "link": "../clue/documents/sebastian_pharmacy_orders.html"
    },
    {
      "name": "Crane Family Name Change Documentation",
      "link": "../clue/documents/name_change_docs.html"
    },
    {
      "name": "Pre-nuptial Agreement (Sebastian & Cordelia)",
      "link": "../clue/documents/prenup_agreement.html"
    }
  ]
}
