{
  "name": "dressmaker",
  "title": "The Dressmaker",
  "personality": "Obsessed with the bride who never wore her dress. Preserving a tragic love story from 1925.",
  "skills": {
    "expert": [],
    "basic": ["spiritual"],
    "personal": ["personal_montrose"]
  },
  "background": "You're descended from Elias Monroe, the dressmaker who created Cordelia Montrose's wedding dress in 1925. The dress that was never worn. The bride who never made it to the altar. Your family has preserved everything from Elias's workshop—his tools, his sketches, his correspondence. But most importantly: the dress itself. White silk, delicate lace, perfect in every detail. A masterpiece that was never worn. Elias was in love with Cordelia. Everyone in your family knows this story. He sent her flowers, wrote her poems, and begged her not to marry Sebastian Crane. Yes, not everyone knows who Cordelia was engaged to. Few people even remember that name: Sebastian Crane. It's as if he was erased from history. But you grew up with this story. You grew up with the dress. You can't stop thinking about Cordelia—the romantic, tragic bride. You preserve her dress like a shrine. You research her life, her death, what could have been. Some people say your fixation is unhealthy. Maybe they're right. But you need to know the truth. What happened to Cordelia? Why did she die?",
  "objectives": {
    "main": "Discover the dark truth behind the three spirits bound to this mansion—The Lonely Ghost, The Heartbroken Ghost, and The Cursed Alchemist Ghost.",
    "private": "Uncover the secret Cordelia shared with Elias Monroe before her death."
  },
  "strategy": "Your knowledge of the Montrose family gives you complete understanding of Cordelia and her family history. Your Basic Spiritual ability helps you sense emotional connections. Your insights are valuable—others can help verify and expand on what you know.",
  "relationships": {
    "heiress": "She lives in the Montrose mansion and might have other items that belonged to Cordelia. Examine these items together to understand the mansion's history.",
    "doctor": "You know Sebastian Crane was a pharmacist, and his brother—the Town Doctor—was a physician. They might have family information about the Crane family and the engagement. Share your knowledge—you both have pieces of this puzzle.",
    "fiduciary": "They have records about the Montrose family and the engagement. Their documents could explain why Cordelia chose Sebastian over Elias and what really happened to Cordelia.",
    "baker": "Their ancestor knew Cordelia's best friend, Alice Whitmore. Their family stories or records might shed light on Cordelia's disappearance and what changed her."
  },
  "starting_items": []
}
