{
  "name": "fiduciary",
  "title": "The Fiduciary",
  "personality": "Pedantic record-keeper obsessed with documentation. You hold all the secrets in your files.",
  "skills": {
    "expert": ["legal"],
    "basic": ["medical"],
    "personal": []
  },
  "background": "You work for a generational wealth management firm that has managed the estates of the Montrose, Crane, and Whitmore families for decades. These properties have been a professional frustration—the haunted mansion has been an eyesore and wasted asset for generations. While researching the Montrose estate, you traced the lineage to find the Heiress and contacted her about the unclaimed property. You hoped she'd take possession and finally do something with it. During your research, you discovered records about the Crane family name change—they became the Sinclairs in the 1960s, apparently for political reasons. You found a box of old papers connecting Dr. Thaddeus Crane to a brother named Sebastian Crane. You've never heard of Sebastian Crane, and you've been managing the estates for years! You sent this box to Dr. Sinclair, curious about their reaction. Now you've noticed some disturbing inconsistencies in death records from 1925, and you're determined to finally understand what happened. You've heard rumors about the ghosts haunting the mansion, and you can't shake off a strange feeling.",
  "objectives": {
    "main": "Discover the dark truth behind the three spirits bound to this mansion—The Lonely Ghost, The Heartbroken Ghost, and The Cursed Alchemist Ghost.",
    "private": "Uncover the document that reveals who the true heir of the Montrose estate really is."
  },
  "strategy": "Your Expert Legal skill lets you analyze estate documents and financial records. Your Basic Medical skill provides limited forensic understanding. Share your documents—others' expertise can reveal what you might miss.",
  "relationships": {
    "heiress": "You found her and gave her the Montrose mansion. She has access to the property and might have discovered important items. Compare what she's found with your estate records to understand the full inheritance picture.",
    "doctor": "You sent them the mysterious box about Sebastian Crane. They might have additional family information. Share your estate records—together you can piece together the Crane family history.",
    "mortician": "Payment records show someone paid their ancestor in October 1925. They have death records that could reveal important details. Connect your financial records with their medical evidence to see the full story.",
    "artcollector": "Their family records might connect to the Crane family business dealings. The Romanos and Cranes may have worked together. Compare notes to understand the full business network."
  },
  "starting_items": []
}
