{
  "name": "influencer",
  "title": "The Influencer",
  "personality": "Content creator documenting everything. This mystery is perfect for your series—if you can debunk the supernatural.",
  "skills": {
    "expert": ["rumors", "history"],
    "basic": [],
    "personal": []
  },
  "background": "You run a popular series called \"Long Beach Urban Legends & Mysteries\" covering local history, unsolved cases, and supernatural claims (which you approach skeptically). You've done episodes on: The Haunted Montrose Mansion—ghostly sightings, rumors of tragedy; The Mysterious Sullivan Bakery Fire—suspicious 1990s fire that destroyed a generations-old bakery; The Romano Treasure Legend—mob family wealth that supposedly escaped the IRS; Cursed Objects & Fatal Timing—featured your friend the Clockmaker and their mysterious pocket watch; The Vanishing Bride—a wealthy woman who disappeared in 1925 then died mysteriously; Long Beach Harbor Ghosts—bootleggers and smugglers at the Port; The Psychic Sisters—the famous Laveau family and 1920s spiritualism. Your latest research: Three mysterious deaths in October 1925. All at the same mansion. All within 11 days. And nobody talks about it. When you heard about this investigation at the Montrose mansion, you knew you had to be here. You brought the Clockmaker (who's obsessed with the timing). You're friends with the Baker (featured their bakery on your food channel). This is going to be your best episode yet.",
  "objectives": {
    "main": "Discover the dark truth behind the three spirits bound to this mansion—The Lonely Ghost, The Heartbroken Ghost, and The Cursed Alchemist Ghost.",
    "private": "Uncover the dark truth behind the bakery fire of 1990."
  },
  "strategy": "Your Expert Rumors skill gives you keys to unlock rumor treasure chests. Your Expert History skill helps with research and source verification. You have access to rumors others don't—share them and let others help separate truth from speculation.",
  "relationships": {
    "clockmaker": "You featured them in your series and brought them here. They're obsessed with timing patterns. Your research skills complement their mystical insights, and you may have documented crucial evidence without realizing it.",
    "baker": "You featured their bakery on your food channel and you're friends. You researched the Sullivan bakery fire for your mysteries series—share your research to help them understand what happened to their family.",
    "psychic": "You covered the Laveau family psychics in an episode. Your skeptical approach can help verify their claims, while their spiritual insights provide unique perspectives. Together you can separate fact from speculation.",
    "others": "Your documentation skills and research archives make you valuable to the investigation. Share your findings—your research combined with others' knowledge could build a complete picture of what happened."
  },
  "starting_items": []
}
