{
  "name": "professor",
  "title": "The Botany Professor",
  "personality": "Distracted genius obsessed with deadly plants. Your ancestor's secrets are tangled in the 1925 deaths.",
  "skills": {
    "expert": ["botanical"],
    "basic": ["medical"],
    "personal": []
  },
  "background": "You're a botany professor, descended from Professor Edmund Hartley who ran a botanical garden and consultation service in 1920s Long Beach. You followed in his footsteps—plant toxicology, medicinal botany, historical uses of plants. Going through old family papers, you found Edmund's consultation records from 1925. A \"pharmaceutical professional\" (anonymous) came to him asking about: Digitalis purpurea (Foxglove)—extraction methods, dosing; Damiana, Valerian, Mandrake—sourcing and preparation; How to mask bitter flavors in medicinal preparations. The notes also contain consultation records with Harbor Import & Trading Co. The specifics raise your suspicions about what exactly this company was and what your ancestor was involved in. You've been obsessed with this mystery ever since. When you heard about the investigation at the Montrose mansion, you had to come. You have a feeling it's all connected.",
  "objectives": {
    "main": "Discover the dark truth behind the three spirits bound to this mansion—The Lonely Ghost, The Heartbroken Ghost, and The Cursed Alchemist Ghost.",
    "private": "Find the name of the plant that played a dark role in the events of 1925."
  },
  "strategy": "Your Expert Botanical skill lets you identify poisonous plants and understand extraction methods. Your Basic Medical skill provides limited toxicology knowledge. Your botanical expertise is crucial—others can help you understand how these poisons were actually used.",
  "relationships": {
    "explorer": "You're friends who complement each other. They're practical and action-oriented, you're theoretical and methodical. Your different approaches help solve complex problems when you combine forces.",
    "doctor": "They have medical expertise and can interpret pharmaceutical formulas. Together you can understand what the poison would actually do to a body.",
    "mortician": "They have records of symptoms and causes of death. Your botanical knowledge combined with their death investigation skills could reveal the truth.",
    "artcollector": "The Romano family imported exotic botanicals. Their shipping records might show where the poison plants came from. Compare notes to trace the source."
  },
  "starting_items": []
}
