{
  "id": "death_cert_cordelia",
  "title": "Certificate of Death - Cordelia Rose Montrose",
  "type": "Official Death Certificate",
  "date": "October 18, 1925",
  "registered": "October 19, 1925",
  "format": "California State Death Certificate - Form No. 26",
  "content": "STATE OF CALIFORNIA\nCOUNTY OF LOS ANGELES\nCERTIFICATE OF DEATH\n\nLOCAL FILE NO.: 1925-0859\n\nFULL NAME OF DECEASED: Cordelia Rose Montrose\nSEX: Female                                   COLOR: White\nAGE: 26 years, 2 months, 12 days\nBIRTHPLACE: Long Beach, California\nUSUAL OCCUPATION: —\nMARITAL STATUS: Single\n\nDATE OF DEATH: October 18, 1925\nHOUR OF DEATH: 06:45\n\nPLACE OF DEATH: Montrose Estate, Long Beach, California\n\nCAUSE OF DEATH: Heart Failure (Natural Causes)\nINJURY: Acute cardiac failure\nCONTRIBUTING FACTORS: Emotional shock from recent bereavement\n\nPHYSICIAN IN ATTENDANCE: Dr. Thaddeus Crane, M.D.\n\nDURATION OF ILLNESS: 7 days\n\nBODY DISPOSITION: Burial - Lakeside Cemetery\n\nNOTES: Young woman deceased one week following death of fiancé. Condition rapidly declined after fiancé's death.\n\nRegistered by: Dr. Thaddeus Crane, M.D.\nDate of Registration: October 19, 1925\n\nExamined by: Silas Blackwell, Mortician\nBlackwell Mortuary, Long Beach\n\n[OFFICIAL SEAL]\nCounty Registrar, Los Angeles County",
  "signedBy": "Dr. Thaddeus Crane, M.D.",
  "examinedBy": "Silas Blackwell, Mortician",
  "character_interpretations": {
    "mortician": "Silas's private notes on Cordelia are the most revealing: 'Her kidneys are scarred. The stomach lining shows mild irritation. Signs of long-term toxin accumulation.' He also documented 'cherry-colored staining around her mouth and teeth' from something 'sweet-smelling, organic, herbal. Mixed with honey.' He concluded: poisoning over time. But the certificate says 'Heart Failure (Natural Causes)' and 'emotional shock from bereavement.' Those are lies.",
    "baker": "Cordelia Rose Montrose died on October 18, 1925. The official record says 'Heart Failure (Natural Causes)' and attributes it to 'emotional shock from recent bereavement.' That bereavement would be her fiancé Sebastian, who died just 7 days before her. But if she was already being poisoned weeks earlier, how much of that grief-induced heart failure is real?",
    "town_doctor": "Three deaths in 11 days at the Montrose Estate. Alice (October 7): Accidental Fall. Sebastian (October 11): Suspected Homicide. Cordelia (October 18): Heart Failure from grief. Each is individually explicable. Together, they form a suspiciously neat narrative where grief is the final consequence.",
    "fiduciary": "The 'Contributing Factors' line is what catches my attention: 'Emotional shock from recent bereavement.' Medical records rarely anthropomorphize causes like that. It's more poetic than clinical. The language suggests someone controlling how the death is officially described.",
    "influencer": "My entire first podcast episode was about Cordelia Montrose's death - 'The Vanishing Bride.' The certificate says 'Heart Failure (Natural Causes)' from 'emotional shock.' But my research found that her health decline began BEFORE Sebastian died. So which emotional shock caused the heart failure - finding out about his affair? Learning about his poisoning? Or something else entirely?",
    "dressmaker": "I have Cordelia's diary. Reading through it chronologically, I can see exactly what happened. September 4th: the elixir ritual begins—Sebastian giving her this special potion every morning. September 10th: she's already experiencing chest pains and heart irregularities. October 8th: she writes 'I am afraid.' October 18th: she's dead. The certificate says 'emotional shock from bereavement'—but that's a lie. The shock wasn't from grief over Sebastian's death. It was from realizing she was being poisoned and couldn't stop it.",
    "clockmaker": "October 18, 1925. Exactly 44 days after the September 4th conjunction—the date on the pocket watch, also 1 week after Cordelia Montrose's death. It's all in the timing. "
  }
}
