{
  "id": "death_cert_alice",
  "title": "Certificate of Death - Alice Margaret Whitmore",
  "type": "Official Death Certificate",
  "date": "October 7, 1925",
  "registered": "October 8, 1925",
  "format": "California State Death Certificate - Form No. 26",
  "content": "STATE OF CALIFORNIA\nCOUNTY OF LOS ANGELES\nCERTIFICATE OF DEATH\n\nLOCAL FILE NO.: 1925-0847\n\nFULL NAME OF DECEASED: Alice Margaret Whitmore\nSEX: Female                                   COLOR: White\nAGE: 22 years, 3 months, 14 days\nBIRTHPLACE: Long Beach, California\nUSUAL OCCUPATION: —\nMARITAL STATUS: Single\n\nDATE OF DEATH: October 7, 1925\nHOUR OF DEATH: 14:15\n\nPLACE OF DEATH: Montrose Estate, Long Beach, California\n\nCAUSE OF DEATH: Accidental Fall\nINJURY: Fractured skull with intracranial hemorrhage\nCONTRIBUTING FACTORS: Severe blunt force trauma\n\nPHYSICIAN IN ATTENDANCE: Dr. Thaddeus Crane, M.D.\n\nDURATION OF ILLNESS: Immediate (acute injury)\n\nBODY DISPOSITION: Burial - Lakeside Cemetery\n\nRegistered by: Dr. Thaddeus Crane, M.D.\nDate of Registration: October 8, 1925\n\nExamined by: Silas Blackwell, Mortician\nBlackwell Mortuary, Long Beach\n\n[OFFICIAL SEAL]\nCounty Registrar, Los Angeles County",
  "signedBy": "Dr. Thaddeus Crane, M.D.",
  "examinedBy": "Silas Blackwell, Mortician",
  "character_interpretations": {
    "mortician": "Silas's family records show he examined Alice on October 7. In his private notes, he recorded something unusual: 'The distribution of trauma concentrated on back of head and spine. Her fingernails are perfect. Unbroken. No defensive marks. No attempt to break the fall.' That's a very specific observation pattern. He was documenting something deliberate.",
    "town_doctor": "The certificate says 'Accidental Fall' but the contributing factors mention 'severe blunt force trauma.' That's an unusual combination. Falls typically don't leave the kind of distributed blunt force trauma that requires special notation. Most falls are catalogued simply as 'injuries consistent with fall.'",
    "professor": "Looking at the official record, Alice Whitmore died October 7, 1925 at the Montrose Estate. The notation is sparse - very official, very clean. For such a young woman (22 years old), you'd expect more context. The fact there's almost no detail about how the fall occurred is notable.",
    "explorer": "The date and location are interesting. October 7, 1925. Same location where two more deaths occur within 11 days. That's not coincidence worthy of investigation, but it's worth noting. Three people in one household within 11 days.",
    "influencer": "From my podcast research, I know that October 7, 1925 was when Alice Whitmore died. But here's what struck me during my research: the official records never mention HOW she fell or WHY she was in a location to fall. The 'severe blunt force trauma' phrasing is unusual - most falls are described as 'injuries consistent with accidental fall,' not 'severe blunt force trauma.'",
    "dressmaker": "Interesting... Signed by Dr. Thaddeus Crane. I found Cordelia's diary among my family's archives. In August 1925, she wrote about confronting Dr. Thaddeus about his affair with Alice—she threatened to expose him to protect Alice. Then Alice dies on October 7. Thaddeus signs the death certificate himself. 'Accidental Fall.' But if Cordelia's threat forced his hand, and Alice was the loose end...",
    "clockmaker": "October 7, 1925. Just three days before Sebastian arrives at Thaddeus's office severely ill. Alice's death precedes the poisoning timeline by mere days. The pocket watch I found is engraved with the Jupiter-Venus conjunction date: September 4, 1925. The timing of her death—three days before Sebastian's collapse—suggests Sebastian could have murdered her if she discovered something suspicious."
  }
}
